<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package from a downloaded Dialpad download.</string>
    <key>Identifier</key>
    <string>com.github.ekristensen14.pkg.Dialpad</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dialpad</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.ekristensen14.download.Dialpad</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/Dialpad.app</string>
            </dict>
        </dict>
        <dict>
          <key>Processor</key>
            <string>com.github.ekristensen14.SharedProcessors/ComponentPkgWrapper</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>  
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.ekristensen14.SharedProcessors/PkgSigner</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>signing_cert</key>
                <string>%SIGNINGCERTIFICATE%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>