<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package from a downloaded Dialpad download.</string>
    <key>Identifier</key>
    <string>com.github.ekristensen14.pkg.Dialpad</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Dialpad</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.ekristensen14.download.Dialpad</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.electron.dialpad.pkg</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
				</dict>
				<key>pkgname</key>
				<string>%NAME%-%ARCH%-%version%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
        <dict>
          <key>Processor</key>
            <string>com.github.ekristensen14.SharedProcessors/ComponentPkgWrapper</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
               <key>signing_cert</key>
                <string>%SIGNINGCERTIFICATE%</string>
                <key>output_pkg_name</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-signed.pkg</string>
            </dict>  
        </dict>
    </array>
</dict>
</plist>