<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Dialpad and imports it into Intune.</string>
	<key>Identifier</key>
	<string>com.github.ekristensen14.intune.Dialpad</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dialpad</string>
        <key>PLATFORM_ARCH</key>
        <string>Insert ARCH (arm64/x64)</string>
		<key>description</key>
		<string>Dialpad is a business communication tool that provides voice calling, messaging, and meetings in a single app </string>
		<key>developer</key>
		<string>Dialpad, Inc.</string>
		<key>display_namee</key>
		<string>Dialpad - %PLATFORM_ARCH%</string>
		<key>categories</key>
        <array>
            <string>Productivity</string>
        </array>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ekristensen14.download.Dialpad</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%pathname%/Dialpad.app</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>displayname</key>
                <string>%display_namee%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleid%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.ekristensen14.intune-upload.processors/IntuneAppUploader</string>
        </dict>
	</array>
</dict>
</plist>
