<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Code and imports it into Intune.</string>
    <key>Identifier</key>
    <string>com.github.ekristensen14.intune.Code</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VSCode</string>
        <key>description</key>
        <string>Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux. It comes with built-in support for JavaScript, TypeScript and Node.js and has a rich ecosystem of extensions for other languages (such as C++, C#, Java, Python, PHP, Go) and runtimes (such as .NET and Unity).</string>
        <key>developer</key>
        <string>Microsoft</string>
        <key>display_namee</key>
        <string>Visual Studio Code</string>
        <key>categories</key>
        <array>
            <string>Development &amp; Design</string>
        </array>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ekristensen14.download.Code</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%input_path%</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%input_path%</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%pkg_path%</string>
                <key>displayname</key>
                <string>%display_namee%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleid%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>display_name</key>
				<string>%display_namee%</string>
				<key>keep_version_count</key>
				<integer>1</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppCleaner</string>
		</dict>
    </array>
</dict>
</plist>