<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.ekristensen14.intune.zoom</string>
	<key>Input</key>
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Zoom and builds a package and imports it into Intune.</string>
		<key>Identifier</key>
		<string>com.github.ekristensen14.intune.zoom</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Zoom</string>
			<key>description</key>
			<string>The Zoom app provides cloud-hosted video conferencing, plus online meetings and group messaging.</string>
			<key>developer</key>
			<string>Zoom Video Communications, Inc.</string>
			<key>display_name</key>
			<string>Zoom</string>
			<key>categories</key>
			<array>
				<string>Productivity</string>
			</array>	
		</dict>	
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ekristensen14.download.zoom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded/zoomus.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/zoom.us.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleVersion</key>
					<string>version</string>
					<key>CFBundleShortVersionString</key>
					<string>jamfversion</string>
					<key>LSMinimumSystemVersion</key>
					<string>min_os_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%RECIPE_CACHE_DIR%/Zoom/Applications/zoom.us.app</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%pathname%</string>
                <key>displayname</key>
                <string>%display_name%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%jamfversion%</string>
                <key>bundleVersion</key>
                <string>%jamfversion%</string>
                <key>bundleId</key>
                <string>%BUNDLE_ID%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>display_name</key>
				<string>%display_name%</string>
				<key>keep_version_count</key>
				<integer>1</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppCleaner</string>
		</dict>

	</array>
</dict>
</plist>
