<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Docker desktop</string>
    <key>Identifier</key>
    <string>com.github.ekristensen14.intune.Docker-arm64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Docker</string>
        <key>description</key>
        <string>Docker Desktop &#8211; the fastest way to containerize applications.</string>
        <key>developer</key>
        <string>Docker</string>
        <key>display_name</key>
        <string>Docker Desktop</string>
        <key>PLATFORM_ARCH</key>
        <string>arm64</string>
        <key>categories</key>
        <array>
            <string>Development &amp; Design</string>
        </array>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.download.DockerDesktop</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%PLATFORM_ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%dmg_path%/Docker.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%app_path%</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%pkg_path%</string>
                <key>displayname</key>
                <string>%display_name%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleid%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
    </array>
</dict>
</plist>