<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Adobe Acrobat Reader and imports it into Intune.</string>
    <key>Identifier</key>
    <string>com.github.ekristensen14.intune.AdobeReader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adobe Reader</string>
        <key>description</key>
        <string>Adobe® Reader® is the global standard for reliably viewing, printing, and commenting on PDF documents. It's the only PDF file viewer that can open and interact with all types of PDF content, including forms and multimedia.</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_namee</key>
        <string>Adobe Reader</string>
        <key>categories</key>
        <array>
            <string>Productivity</string>
        </array>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.AdobeReader</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/*/application.pkg</string>
			</dict>
            <key>Processor</key>
			<string>FileFinder</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.app</string>
			</dict>
            <key>Processor</key>
			<string>FileFinder</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%found_filename%/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleID</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%found_filename%</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/*.pkg</string>
			</dict>
            <key>Processor</key>
			<string>FileFinder</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
			</dict>
            <key>Processor</key>
			<string>PathDeleter</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%found_filename%</string>
                <key>displayname</key>
                <string>%display_namee%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleID%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>display_name</key>
				<string>%display_namee%</string>
				<key>keep_version_count</key>
				<integer>1</integer>
				<key>test_mode</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppCleaner</string>
		</dict>
    </array>
</dict>
</plist>