<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.ekristensen14.intune.OpenVPN Connect Client 3-arm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenVPNConnectClient3</string>
        <key>DERIVE_MIN_OS</key>
        <string>YES</string>
        <key>ARCH</key>
        <string>arm64</string>
        <key>description</key>
        <string>Official OpenVPN client for Mac for connecting to VPN servers using the OpenVPN protocol.</string>
        <key>developer</key>
        <string>OpenVPN</string>
        <key>display_namee</key>
        <string>OpenVPN Connect - arm64</string>
		<key>categories</key>
		<array>
			<string>Other apps</string>
		</array>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>ParentRecipe</key>
    <string>com.github.ekristensen14.download.OpenVPN Connect Client 3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/OpenVPN*%ARCH%*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/OpenVPN_%ARCH%.pkg</string>
                <key>overwrite</key>
                <true/>
                <key>source_path</key>
                <string>%pathname%/OpenVPN*%ARCH%*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/OpenVPN_%ARCH%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/tmp-app.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/OpenVPN Connect/OpenVPN Connect.app</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/OpenVPN Connect/OpenVPN Connect.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%input_path%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>	
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
                <string>%pkg_path%</string>
                <key>displayname</key>
                <string>%display_namee%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleid%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>display_name</key>
				<string>%display_namee%</string>
				<key>keep_version_count</key>
				<integer>1</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppCleaner</string>
		</dict>

        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/</string>
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>